<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
 <HEAD>
   <TITLE> [Jabberfriends-developer] Meine Verbesserungsvorschl&#228;ge
   </TITLE>
   <LINK REL="Index" HREF="http://lists.berlios.de/pipermail/jabberfriends-developer/2006-May/index.html" >
   <LINK REL="made" HREF="mailto:jabberfriends-developer%40lists.berlios.de?Subject=Re%3A%20%5BJabberfriends-developer%5D%20Meine%20%3D%3FISO-8859-15%3FQ%3FVerbesserung%3F%3D%0A%20%3D%3FISO-8859-15%3FQ%3Fsvorschl%3DE4ge%3F%3D&In-Reply-To=%3C446B7963.3080201%40gultsch.de%3E">
   <META NAME="robots" CONTENT="index,nofollow">
   <style type="text/css">
       pre {
           white-space: pre-wrap;       /* css-2.1, curent FF, Opera, Safari */
           }
   </style>
   <META http-equiv="Content-Type" content="text/html; charset=us-ascii">
   <LINK REL="Previous"  HREF="000001.html">
   <LINK REL="Next"  HREF="000003.html">
 </HEAD>
 <BODY BGCOLOR="#ffffff">
   <H1>[Jabberfriends-developer] Meine Verbesserungsvorschl&#228;ge</H1>
    <B>Daniel Gultsch</B> 
    <A HREF="mailto:jabberfriends-developer%40lists.berlios.de?Subject=Re%3A%20%5BJabberfriends-developer%5D%20Meine%20%3D%3FISO-8859-15%3FQ%3FVerbesserung%3F%3D%0A%20%3D%3FISO-8859-15%3FQ%3Fsvorschl%3DE4ge%3F%3D&In-Reply-To=%3C446B7963.3080201%40gultsch.de%3E"
       TITLE="[Jabberfriends-developer] Meine Verbesserungsvorschl&#228;ge">daniel at gultsch.de
       </A><BR>
    <I>Wed May 17 21:28:35 CEST 2006</I>
    <P><UL>
        <LI>Previous message: <A HREF="000001.html">[Jabberfriends-developer] Meine Verbesserungsvorschl&#228;ge
</A></li>
        <LI>Next message: <A HREF="000003.html">[Jabberfriends-developer] Meine Verbesserungsvorschl&#228;ge
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#2">[ date ]</a>
              <a href="thread.html#2">[ thread ]</a>
              <a href="subject.html#2">[ subject ]</a>
              <a href="author.html#2">[ author ]</a>
         </LI>
       </UL>
    <HR>  
<!--beginarticle-->
<PRE>-----BEGIN PGP SIGNED MESSAGE-----
Hash: SHA1

Achja, noch mal an die Mailingliste (ich war verpeilt)

Falco Vennedey schrieb:
&gt;<i> Hiho!
</I>&gt;<i>
</I>&gt;<i> Ich habe mal die Quellcodes ein wenig &#252;berflogen. Mir sind da so ein
</I>&gt;<i> paar Dinge aufgefallen die evt. besser gemacht werden k&#246;nnten. Versteht
</I>&gt;<i> das bitte nicht falsch, ich m&#246;chte hier nicht als Besserwisser auftreten
</I>&gt;<i> oder sagen das hier jemand schlecht programmiert - ich m&#246;chte nur dass
</I>&gt;<i> das Projekt von anfang an sauber durchgezogen wird und hinterher alle
</I>&gt;<i> weniger Arbeit bei der Wartung haben.
</I>Es versteht dich keiner falsch. Es ist sch&#246;n, das du mich (uns) auf
Fehler aufmerksam machst.
&gt;<i>
</I>&gt;<i> Meine Verbesserungsvorschl&#228;ge
</I>&gt;<i> =============================
</I>&gt;<i>
</I>&gt;<i> Ich bin der Meinung dass man gerade in einer so Fehlertr&#228;chtigen Sprache
</I>&gt;<i> wie PHP alles tun sollte um Fehler aufzudecken. Daher bin ich daf&#252;r dass
</I>&gt;<i> alle mit der Einstellung error_reporting=E_ALL hacken sollten. Was mir
</I>&gt;<i> beispielsweise beim &#220;berfliegen des Quelltextes der Datei
</I>&gt;<i> &quot;changedetails.php&quot; aufgefallen ist, das z.B. in Zeile 30 aus $birthday
</I>&gt;<i> pl&#246;tzlich $birtday wird - sowas muss auch getestet werden um Fehler
</I>&gt;<i> aufzudecken.
</I>error_reporting=E_ALL ist eine gute Idee - wie das mit $birthday
zustande kam weis ich nicht. Es war wohl sp&#228;t ;-)
&gt;<i>
</I>&gt;<i> Was mich erst stark ins Stuzen gebracht hat war folgende Zeile (Z. 15 in
</I>&gt;<i> wiki.php): $id = $id + 0;
</I>&gt;<i> Ich denke mal dass damit eine Typenumwandlung von String zu int erfolgen
</I>&gt;<i> sollte. PHP bietet daf&#252;r doch extra Funktionen an um so etwas
</I>&gt;<i> durchzuziehen. Eine gute M&#246;glichkeit ist z.B.: $id =
</I>&gt;<i> intval(ereg_replace('[^0-9]','',$_GET['id']));
</I>&gt;<i> Ich denke das dies wesentlich besser ist als etwas mit 0 zu addieren :D
</I>War irgendwie ein dummer Hack... ich hatte auf Anhieb keine Funktion wie
to_int() oder so gefunden.
&gt;<i>
</I>&gt;<i> Was mir auch ziemlich schnell ins Auge fiel ist dass ihr um Teile von
</I>&gt;<i> Strings zu ermitteln den Verkettungsoperator . mit den jeweiligen
</I>&gt;<i> Indizes des Strings einsetzt. Ich versteh das nicht so ganz weil der
</I>&gt;<i> Funktionsumfang von PHP extra die Funktion substr() f&#252;r so etwas hat.
</I>&gt;<i> Ich w&#252;rde euch ans Herz legen diese Funktion zu benutzen.
</I>Mhh... ich hab's so gelernt...
&gt;<i>
</I>&gt;<i> Des weiteren wurden mal &quot;Doppelte Anf&#252;hrungszeichen&quot; und mal 'Einfache
</I>&gt;<i> Anf&#252;hrungszeichen' benutzt. Ich denke dass wir und auf eine Form einigen
</I>&gt;<i> und diese konsequent durchziehen sollten. Ich pers&#246;nlich w&#252;rde die
</I>&gt;<i> Einfachen bevorzugen, da diese performanter und durchsichtiger sind was
</I>&gt;<i> die intigration von Variablen angeht.
</I>Das Doppelte Anf&#252;hrungszeichen langsam sind, wei&#223; ich mitlerweile auch.
Die Stellen, an denen sie noch sind, sind entweder ziemlich alt, oder
nicht von mir. In Zukunft einigen wir uns also auf Einfache.
&gt;<i>
</I>&gt;<i> Wenn gepr&#252;ft wird ob eine Variable leer ist wird von euch das Konstrukt
</I>&gt;<i> if($x==&quot;&quot;) verwendet. Das ist unpraktisch und langsam. PHP stellt daf&#252;r
</I>&gt;<i> die Funktion empty() zur Verf&#252;gung welche ich euch auch ans Herz legen
</I>&gt;<i> m&#246;chte.
</I>Wieder etwas, was ich einmal gelernt habe, und nie wieder hinterfragt
habe. Nett, das du mich darauf hinweist.
&gt;<i>
</I>&gt;<i> Eine Kleinigkeit, aus der aber bei vielen Schleifen sehr schnell zu
</I>&gt;<i> Performanceeinbu&#223;en f&#252;hren kann: Ihr benutzt Postinkrement-, bzw.
</I>&gt;<i> Postdekrementoperatorn ($i++, $i--). Der Preinkrement, bzw.
</I>&gt;<i> Predekrementoperator (++$i, --$i) ist aber ein wenig schneller - zwar
</I>&gt;<i> nur wenig aber schneller :-)
</I>For-Schleifen? Die gibt's glaube ich nur einmal, oder? Also, wenn das
wirklich nur ein bisschen schneller ist, w&#228;re ich daf&#252;r, dass bei $i++
zulassen. Ich bin das von Java und so einfach gew&#246;hnt.
&gt;<i>
</I>&gt;<i> Speedm&#228;&#223;ig ist auch noch die Verwendung von Kurzoperatoren anzuraten,
</I>&gt;<i> also $x .= $y; anstelle von $x = $x.$y; - das gleiche mit +=, -= usw.
</I>&gt;<i> Das ist schneller und macht den Code &#252;bersichtlicher.
</I>Das es schneller ist, kann sein. Aber &#252;bersichtlicher, dar&#252;ber l&#228;sst
sich streiten...
&gt;<i>
</I>&gt;<i> Besonders aus Speedgr&#252;nden sollten Objekte als Referenzen erzeugt
</I>&gt;<i> werden, da sonst bei jedem Aufruf von $this das komplette Objekt kopiert
</I>&gt;<i> wird, was zu einen enormen Overhead f&#252;hrt. Referenzen werden mit =&amp;
</I>&gt;<i> angelegt.
</I>Das mit den Referenzen wusste ich nicht. Das muss auf jeden Fall
ge&#228;ndert werden.
&gt;<i>
</I>&gt;<i> Bei den if() Konstrukten wo nur eine Anweisung hinter folgt k&#246;nnen die
</I>&gt;<i> Blockklammern auch weggelassen werden. Das macht den Code wesendlich
</I>&gt;<i> &#252;bersichtlicher und man sollte diesen Luxus auch nutzen, denn in Perl
</I>&gt;<i> hat man den z.B. nicht, dort m&#252;ssen {} gesetzt werden und der Code wird
</I>&gt;<i> unleserlich.
</I>Auch hierdr&#252;ber l&#228;sst sich streiten. Ich finde die { } extrem n&#252;tzlich.
&gt;<i>
</I>&gt;<i> Die Benennung von Variablen sollte von vorn herein durchdacht werden.
</I>&gt;<i> Warum hei&#223;t z.B. eine Variable welche die MySQL Datenbank beinhaltet
</I>&gt;<i> $config['mysql_table'] und nicht $config['mysql_db'] o.&#228;.?
</I>Ok, das ist ein Fehler der mir, bis Montag, nicht aufgefallen ist.
Blase16 hat es wohl gemerkt, aber nichts gesagt.
&gt;<i>
</I>&gt;<i>
</I>&gt;<i> Evt. sollte sich der ein oder andere nochmal das Ziel von OOP vor Augen
</I>&gt;<i> f&#252;hren. Ich Versteh nicht warum z.B. in der Datei jforg_template.php in
</I>&gt;<i> den Zeilen 56 und 57 auf die Funktion str_replace() zugegriffen wird, wo
</I>&gt;<i> diese doch l&#228;ngst in der Methode replace() der Klasse gekapselt wurde.
</I>&gt;<i> So wird der Code nur immer unwartbarer und das m&#246;chte denke ich keiner
</I>&gt;<i> von uns :)
</I>Stimmt. Da hab ich einfach nicht nachgedacht.
&gt;<i>
</I>&gt;<i> Was OOP angeht sollte sowieso nochmal alles ein wenig durchdacht werden.
</I>&gt;<i> Da ich bereits ziemlich viele MySQL Funktionsaufrufe und
</I>&gt;<i> Datumsfunktionsaufrufe gesehen habe denke ich das eine eigene MySQL bzw.
</I>&gt;<i> Datumsklasse doch schon viel Sinn hat. So l&#228;sst sich beispielsweise in
</I>&gt;<i> der MySQL Klasse noch eine Methode implementieren, welche vor
</I>&gt;<i> SQL-injection Angriffen sch&#252;tzt. Ich f&#228;nde das viel viel &#252;bersichtlicher
</I>&gt;<i> und wesentlich besser gel&#246;st als jedesmal auf die globalen Funktionen
</I>&gt;<i> erneut zuzugeifen.
</I>Eine SQL Klasse steht auf jedem Fall auf dem Plan. Allein aus dem Grund,
das man bequem zu SQLite oder PostgreSQL wechseln kann. Mir ist selber
schon aufgefallen, das ich in jeder Klasse eine neue Verbindung aufbaue,
was ja total sinnlos ist.
&gt;<i>
</I>&gt;<i> Die Ordnerf&#252;hrung ist meines Erachtens auch ein wenig irref&#252;hrend: Warum
</I>&gt;<i> gibt es den Ordner Design welcher nur das Template enth&#228;lt und nochmal
</I>&gt;<i> extra den Ordner GFX. Hat GFX nix mit Design zu tun? Ich f&#228;nde GFX in
</I>&gt;<i> Design besser aufgehoben. Generell bin ich der Ansicht dass das Design
</I>&gt;<i> noch nicht optimal vom Code getrennt ist. Wenn jemand von euch mal z.B.
</I>&gt;<i> mit Smarty als Templateengine gearbeitet hat weis er genau was ich
</I>&gt;<i> meine. Ich denke dass dieser Punkt nochmals genau durchdacht werden
</I>&gt;<i> sollte, auch wenn dadurch bis jetzt geschriebene Klassen evt. verworfen
</I>&gt;<i> werden m&#252;ssen ist es doch ein Entscheidener Punkt. Das gleiche gilt f&#252;r
</I>&gt;<i> die Modularisierung der Texte vom Rest der Seite. So lassen sich die
</I>&gt;<i> Texte besser verwalten. Ich schlage hier anstelle einer DB-Tabelle ein
</I>&gt;<i> XML-File vor, da dieses f&#252;r solche Aufgaben wesentlich flexiebler ist.
</I>&gt;<i> Das Linkmanagement sollte auch nochmal &#252;berholt werden, so dass keine
</I>&gt;<i> festen Linkadressen im Code konstant hinterlegt werden, dies hat auch
</I>&gt;<i> eine bessere Wartbarkeit zur Folge.
</I>Der Ordner GFX wird wohl bald gel&#246;scht, bisher ist da eh nur der Header
drin.
Was du jetzt mit den Texten meinst, versteh ich nicht. Jeder l&#228;ngere
Satz kommt aus der Datenbank...
&gt;<i>
</I>&gt;<i> Was ich Ordnerf&#252;hrungstechnisch auch noch nicht so 100% perfekt finde
</I>&gt;<i> ist die Tatsache, dass in dem Ordner classes nicht nur Klassen sondern
</I>&gt;<i> auch globale Funktionen liegen. Dies sollte evt. auch nochmal &#252;berdacht
</I>&gt;<i> werden.
</I>Als ich da Datei da rein gelegt habe, hatte ich keine Lust, f&#252;r eine
Funktion einen extra Ordner anzulegen. Das sollten wir in Zukunft besser
machen.
&gt;<i>
</I>&gt;<i> Dann noch ein letzter Punkt der noch konkret die GUI betrifft: Ich f&#228;nde
</I>&gt;<i> es besser wenn der User die M&#246;glichkeit hat seinen PGP-Key mittels eines
</I>&gt;<i> Dateiuploads hochzuladen. Das ist etwas Userfreundlicher.
</I>Kann man sicher machen. Aber das sind doch Feinheiten, zum Programmieren
ist das Textfeld auf jeden Fall leichter zu handhaben.
&gt;<i>
</I>&gt;<i>
</I>&gt;<i> So, ich hoffe ihr versteht meine Kritikpunkte, - was haltet ihr von
</I>&gt;<i> meinen Vorschl&#228;gen?
</I>Versteh das jetzt bitte nicht flasch. Blase16 und ich sind jetzt schon
ewig mit der Seite besch&#228;ftigt, und wollen endlich eine 0.1 beta fertig
haben, um etwas f&#252;r die &#214;ffentlichkeit zu haben. Zudem k&#246;nnen wir die
Autoren (f&#252;r's wiki) erst besch&#228;ftigen, wenn das wiki fertig ist.
Wenn wir bald zu dritt sind, ist das ganz nat&#252;rlich ein bisschen
entspannter. Wenn es dir recht w&#228;re, w&#252;rden wir die gro&#223;en &#196;nderungen
erst machen, wenn 0.1 fertig ist. Den Code noch mal durchzugehen, und
das Ein oder Andere anzupassen ist nat&#252;rlich nicht falsch.
&gt;<i>
</I>&gt;<i> MFG Zwerg
</I>Wenn wir zusammen arbeiten, sollten wir uns beim Vornamen ansprechen. -
Wenn du nichts dagegen hast.

Ich bin der Daniel

Gru&#223; Daniel
_______________________________________________
Jabberfriends-developer mailing list
<A HREF="https://lists.berlios.de/mailman/listinfo/jabberfriends-developer">Jabberfriends-developer at lists.berlios.de</A>
<A HREF="http://lists.berlios.de/mailman/listinfo/jabberfriends-developer">http://lists.berlios.de/mailman/listinfo/jabberfriends-developer</A>

-----BEGIN PGP SIGNATURE-----
Version: GnuPG v1.4.1 (GNU/Linux)
Comment: Using GnuPG with Mozilla - <A HREF="http://enigmail.mozdev.org">http://enigmail.mozdev.org</A>

iD8DBQFEa3ljk7+UCPW7+jARAvp9AKCg2EIM6H/xBK8SYyNxTaDFbL38qwCfYAb8
XClDqC7QAaF32/8WL+DZVms=
=Of8f
-----END PGP SIGNATURE-----

</PRE>

<!--endarticle-->
    <HR>
    <P><UL>
        <!--threads-->
	<LI>Previous message: <A HREF="000001.html">[Jabberfriends-developer] Meine Verbesserungsvorschl&#228;ge
</A></li>
	<LI>Next message: <A HREF="000003.html">[Jabberfriends-developer] Meine Verbesserungsvorschl&#228;ge
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#2">[ date ]</a>
              <a href="thread.html#2">[ thread ]</a>
              <a href="subject.html#2">[ subject ]</a>
              <a href="author.html#2">[ author ]</a>
         </LI>
       </UL>

<hr>
<a href="https://lists.berlios.de/mailman/listinfo/jabberfriends-developer">More information about the Jabberfriends-developer
mailing list</a><br>
</body></html>
